{
  "section_title": "Як працює алгоритм об'єднання",
  "intro": "Цей інструмент допомагає об'єднати кілька файлів необроблених даних ДНК з різних тестових компаній (AncestryDNA, MyHeritage, 23andMe, FamilyTreeDNA, LivingDNA) в єдиний, комплексний генетичний профіль. Ось як працює алгоритм:",
  "problem": {
    "title": "Яку проблему це вирішує?",
    "description": "Коли ви проходите тестування в кількох компаніях ДНК, кожна компанія може:",
    "list": {
      "different_snps": "Тестувати різні SNP (генетичні маркери)",
      "gaps": "Мати прогалини в своїх даних (без викликів, показано як \"--\")",
      "conflicts": "Іноді давати конфліктуючі результати для одного SNP"
    },
    "conclusion": "Цей алгоритм інтелектуально об'єднує ваші файли, щоб дати вам найповнішу картину вашої ДНК."
  },
  "process": {
    "title": "Тристадійний процес об'єднання",
    "step1": {
      "title": "Крок 1: Завантаження першого файлу",
      "description": "Алгоритм зчитує всі SNP з вашого першого файлу та індексує їх за RSID (унікальний ідентифікатор, наприклад \"rs3131972\")"
    },
    "step2": {
      "title": "Крок 2: Обробка додаткових файлів",
      "description": "Для кожного SNP у ваших додаткових файлах алгоритм перевіряє, чи вже існує RSID. Якщо він новий, він додається. Якщо він існує з іншим генотипом, він вирішує конфлікт за обраною вами стратегією. Цей процес повторюється для всіх завантажених файлів."
    },
    "step3": {
      "title": "Крок 3: Сортування за геномною позицією",
      "description": "Фінальний об'єднаний файл сортується за номером хромосоми (1, 2, 3... 22, X, Y, MT) та позицією, відповідаючи стандартним геномним посиланням"
    }
  },
  "conflict_resolution": {
    "title": "Стратегії вирішення конфліктів",
    "description": "Коли один SNP має різні генотипи в кількох файлах, ви можете вибрати:",
    "fill_missing": {
      "title": "\"Заповнити відсутні\" (Рекомендовано):",
      "description": "Якщо один файл має відсутні дані (\"--\" або \"00\"), а інший має значення, використовувати значення. Якщо обидва мають значення, використовувати пріоритетний файл. Це максимізує покриття."
    },
    "prefer_file": {
      "title": "\"Віддати перевагу файлу\":",
      "description": "Завжди використовувати генотип з вашого пріоритетного файлу, незалежно від відсутніх даних. Простіше, але може втратити дійсні дані."
    }
  },
  "understanding_data": {
    "title": "Розуміння ваших даних ДНК",
    "description": "Кожен SNP (однонуклеотидний поліморфізм) містить:",
    "rsid": "RSID: Унікальний ідентифікатор (наприклад, \"rs3131972\")",
    "chromosome": "Хромосома: Розташування (1-22, X, Y або MT для мітохондріальної)",
    "position": "Позиція: Точне розташування пари основ на цій хромосомі",
    "genotype": "Генотип: Ваші два алелі в цій позиції (наприклад, \"AA\", \"GC\", \"TT\"). Ви успадковуєте по одному від кожного з батьків"
  },
  "why_matters": {
    "title": "Чому це важливо для генеалогії",
    "list": {
      "matches": "Максимізація збігів ДНК: Більше протестованих SNP означає кращу точність збігів з генетичними родичами",
      "gaps": "Заповнення прогалин тестування: Компанії тестують різні SNP; об'єднання дає вам ширше покриття",
      "accuracy": "Порівняння точності тестування: Файл журналу показує, де компанії не погодились",
      "tools": "Використання спеціалізованих інструментів: Деякі інструменти генетичної генеалогії потребують конкретних SNP, які тестують лише певні компанії"
    }
  },
  "footer": "Алгоритм розроблений для того, щоб бути консервативним і прозорим, даючи вам впевненість, що ваш об'єднаний файл ДНК точно представляє ваші генетичні дані, максимізуючи повноту."
}
