{
  "title": "Об'єднання файлів ДНК",
  "subtitle": "Завантажте 1-10 файлів ДНК для конвертації або об'єднання з вирішенням конфліктів на основі пріоритету або консенсусу",
  "supported_input_formats": "Підтримувані вхідні типи файлів:",
  "supported_output_formats": "Підтримувані вихідні типи файлів:",
  "github_badge": "Переглянути на GitHub",
  "disclaimer": {
    "title": "Застереження:",
    "message": "Цей інструмент призначений виключно для генеалогічних досліджень та особистих інформаційних цілей. Він не призначений для медичного, діагностичного чи наукового використання. Результати надаються як є, без гарантій точності чи повноти. Для медичних рішень або питань здоров'я зверніться до кваліфікованих медичних працівників та сертифікованих генетичних консультантів."
  },
  "privacy": {
    "title": "Ваша конфіденційність захищена:",
    "message": "Вся обробка файлів ДНК відбувається повністю у вашому браузері на вашому комп'ютері. Жодні дані не завантажуються на сервер. Ваша генетична інформація ніколи не покидає ваш пристрій."
  },
  "options": {
    "output_format": "Формат виводу:",
    "conflict_resolution": "Вирішення конфліктів:",
    "resolution_priority": "На основі пріоритету",
    "resolution_consensus": "Перемога за консенсусом",
    "fill_missing": "Заповнити відсутні значення:",
    "parse_multibase": "Парсити багатобазові генотипи (Indels):",
    "include_invalid_positions": "Включити SNP з позицією 0,0:",
    "tooltip_conflict_resolution": "При об'єднанні 3+ файлів, оберіть, як вирішувати конфлікти, де файли розходяться в одному SNP. 'Перемога за консенсусом' вибирає генотип, що зустрічається найчастіше у всіх файлах, з нічиїми, що вирішуються пріоритетом файлу.",
    "tooltip_fill": "Якщо увімкнено, заповнює відсутні значення (-- або 00), перевіряючи файли в порядку пріоритету і використовуючи перше знайдене непусте значення. Якщо вимкнено, завжди використовує значення з першого файлу (найвищий пріоритет).",
    "tooltip_multibase": "Якщо увімкнено, розділяє довгі Indel генотипи як 'TAAGTGTAAGTG' на 'TAAGTG TAAGTG'. Якщо вимкнено (за замовчуванням), ці варіанти пропускаються. В основному стосується файлів LivingDNA.",
    "tooltip_invalid_positions": "Включати рядки з хромосомою='0' або позицією='0', якщо вони мають стандартні rsID (наприклад, 'rs123') або непусті алелі. Рядки з власними назвами ТА пустими алелями (--) завжди пропускаються."
  }
}
